Proyecto_Codisan/app/controllers/admin/courses/matters_controller.rb

SELECT "matters".* FROM "matters" INNER JOIN "course_matters" ON "matters"."id" = "course_matters"."matter_id" WHERE "course_matters"."course_id" = $1 AND "matters"."id" = $2 LIMIT $3  [["course_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def show
        @matter = @course.matters.find(params[:id])

INSERT INTO "matters" ("name_matter", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name_matter", "8"], ["created_at", "2022-05-13 22:27:42.891076"], ["updated_at", "2022-05-13 22:27:42.891076"]]
---
    def create
        params[:course] [:user_ids] ||= []
        if @matter.save