Proyecto_Codisan/app/views/courses/_course.html.erb

SELECT "courses"."id" FROM "courses" INNER JOIN "course_users" ON "courses"."id" = "course_users"."course_id" WHERE "course_users"."user_id" = $1  [["user_id", 2]]
---
        <% else %>
            <%= link_to current_user.course.where(id: current_user.id).collect%>