Proyecto_Codisan/app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("name_photo", "description", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5) RETURNING "id"