Proyecto_Codisan/app/views/users/_form.html.erb

    <%= form_with(model: @user) do |form| %>
    <%= form.collection_check_boxes :role_ids, Role.all, :id, :name, class:"form-check-input", id:"inlineCheckbox1"%>
---
SELECT "roles".* FROM "roles"