Proyecto_Codisan/app/views/users/index.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]
---
              <td><%= user.first_last_name %> </td>
              <td><%= user.roles.pluck(:name) %></td>