Proyecto_Codisan/app/controllers/admin/courses_controller.rb

    def new
      @students = User.all
---
SELECT "users".* FROM "users"

  def edit
    authorize User
    @students = User.all
---
SELECT "users".* FROM "users"