Proyecto_Codisan/app/controllers/admin/courses_controller.rb

    def index
       if current_user.has_role? :admin
            @courses = Course.all
---
SELECT "courses".* FROM "courses"

    def asignar
        @course = Course.find(params[:course_id])
        @matters = Matter.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "matters".* FROM "matters"

    def guardar
        @course = Course.find(params[:course_id])
        @matter = Matter.find(params[:matter_id])
        @course.matters << @matter
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "matters".* FROM "matters" WHERE "matters"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "courses" ("name_course", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name_course", ""], ["created_at", "2022-06-08 21:42:41.916474"], ["updated_at", "2022-06-08 21:42:41.916474"]]
INSERT INTO "course_matters" ("course_id", "matter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 2], ["matter_id", 7], ["created_at", "2022-05-13 23:29:45.144021"], ["updated_at", "2022-05-13 23:29:45.144021"]]

    def create
        @course = Course.new(course_params)
        if @course.save
---
INSERT INTO "courses" ("name_course", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name_course", "9-A"], ["created_at", "2022-05-13 19:43:55.967990"], ["updated_at", "2022-05-13 19:43:55.967990"]]

      def edit
         authorize User
          @Course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def destroy
        @course = Course.find(params[:id])
        if @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]