Proyecto_Codisan/app/controllers/admin/matters_controller.rb

    def index
        @matters = Matter.all
---
SELECT "matters".* FROM "matters"

    def create
        @matter = Matter.new(matter_params)
        if @matter.save
---
INSERT INTO "matters" ("name_matter", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name_matter", "quimica"], ["created_at", "2022-05-13 20:24:50.574683"], ["updated_at", "2022-05-13 20:24:50.574683"]]

    def edit
        @matter = Matter.find(params[:id])
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @matter = Matter.find(params[:id])
        if @matter.update(matter_params)
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "matters" SET "name_matter" = $1, "updated_at" = $2 WHERE "matters"."id" = $3  [["name_matter", "Matematicas"], ["updated_at", "2022-05-13 21:31:05.180976"], ["id", 6]]

    def destroy
        @matter = Matter.find(params[:id])
        if @matter.destroy
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "matters" WHERE "matters"."id" = $1  [["id", 1]]