Proyecto_Codisan/app/views/admin/courses/_form.html.erb

                  <td>
                    <%= check_box_tag "course[user_ids][]", user.id, @course.users.include?(user)%>
---
SELECT "users".* FROM "users"
SELECT 1 AS one FROM "users" INNER JOIN "course_users" ON "users"."id" = "course_users"."user_id" WHERE "course_users"."course_id" = $1 AND "users"."id" = $2 LIMIT $3  [["course_id", 1], ["id", 2], ["LIMIT", 1]]