Proyecto_Codisan/app/views/admin/courses/asignar.html.erb


    <%= select_tag 'matter_id', options_for_select(@matters.collect{ |u| [u.name_matter, u.id] }) %>
---
SELECT "matters".* FROM "matters"