Proyecto_Codisan/app/views/admin/courses/matters/_form.html.erb

SELECT "matters".* FROM "matters"
---

   <%= f.select :name_matter, Matter.all.map{|m| [m.name_matter, m.id]} %>